# BuildingEnvelopeAnalyzerOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuildingEnvelopeAnalyzerOptions Properties
BuildingEnvelopeAnalyzerOptions Class See Also
---
The BuildingEnvelopeAnalyzerOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalyzeEnclosedSpaceVolumes | Whether or not to analyze interior connected regions inside the building forming enclosed space volumes. |
| GridCellSize | The cell size for the uniform cubical grid used when analyzing the building envelope. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OptimizeGridCellSize | Whether or not to use the exact value for the cell size or let the analyzer optimize the cell size based on the specified grid size |

# See Also
BuildingEnvelopeAnalyzerOptions Class
Autodesk.Revit.DB.Analysis Namespace